Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/travel_documents_for_refugees.html.txt.tmx
Source language: en
Languages: ga

source: Travel documents for people with refugee or subsidiary protection status
ga: Cáipéisí taistil do dhaoine le stádas dídeanaithe nó cosanta coimhdí

source: People who have international protection (refugee status or international protection) who are living in Ireland may apply for a travel document to allow them to travel outside Ireland
ga: Is féidir le duine le stádas dhídeanaithe nó fochosantas iarratas a dhéanamh ar cháipéis taistil chun taisteal thar lear. Bíonn daoine a ndéantar cosanta coimhdí a cheadú dóibh incháilithe freisin chun iarratas a dhéanamh ar dhoiciméad taistil

source: You can find information about travel documents on the website of the Irish Naturalisation and Immigration Service
ga: Is féidir leat teacht ar fhaisnéis faoi dhoiciméid taistil ar láithreán gréasáin Sheirbhís Eadóirdseachta agus Inimirce na hÉireann

source: You are eligible to apply to the Minister for Justice and Equality for a travel document if you:
ga: Tá tú i dteideal iarratas a dhéanamh leis an Aire Dlí, Cirt agus Comhionannais le haghaidh doiciméad taistil:

source: • Have been granted refugee status in accordance with the Geneva Convention of 1951
ga: • Má bronnadh ort stádas dídeanaí i gcomhréir le Coinbhinsiún na Ginéive, 1951

source: • Are a family member of a person with refugee status who has been granted family reunification
ga: • Más ball teaghlaigh thú ina bhfuil duine ag a bhfuil stádas dídeanaí ar ar bronnadh athaontú teaghlaigh

source: • Have been declared stateless in accordance with the New York Convention of 1954
ga: • Má dearbhaíodh gur duine gan stát thú i gcomhréir le Coinbhinsiún na Ginéive, 1954

source: • Have been granted subsidiary protection
ga: • Má ceadaíodh cosaint choimhdeach duit

source: (Family members who have been granted permission to remain in Ireland as a result are also eligible to apply for a travel document)
ga: (Tá baill teaghlaigh nár tugadh cead dóibh fanacht in Éirinn mar thoradh air seo i dteideal, freisin, iarratas a dhéanamh ar dhoiciméad taistil)

source: • Have been declared a Programme refugee in accordance with section 24 of the Refugee Act 1996 as amended
ga: • Má dearbhaíodh gur dídeanaí Cláir thú i gcomhréir le halt 24 d’Acht na nDídeanaithe, 1996 (arna leasú)

source: If you have refugee status or subsidiary protection, you may travel freely in and out of the state with this document
ga: Féadann tú taisteal saor ó bhac laistigh agus lasmuigh den stát leis an gcáipéis seo

source: You may travel to most EU states with this document without the need to obtain a visa
ga: Is féidir leat taisteal chuig mórchuid de bhallstáit an AE leis an gcáipéis seo gan víosa a fháil

source: However, some countries require a visa, so it is always advisable to check with the embassy of whichever country you intend travelling to about visa requirements
ga: Teastaíonn víosa ó roinnt tíortha, áfach, mar sin moltar duit seiceáil le hambasáid pé tír a bhfuil sé i gceist agat taisteal chuici i dtaobh riachtanais víosa

source: You do not require a re-entry visa to come back into Ireland
ga: Ní theastaíonn víosa athiontrála uait chun filleadh ar Éirinn

source: Your children need their own travel document
ga: Teastaíonn a ndoiciméad féin taistil ó do leanaí

source: An application for a child must be accompanied by the child’s birth certificate and evidence that the child is resident in Ireland
ga: Ní mór go ngabhfaidh teastas breithe an linbh mar aon le fianaise go bhfuil cónaí in Éirinn ar an leanbh le hiarratas le haghaidh linbh

source: Travel documents for children aged from 5 to 17 years are valid for up to 10 years
ga: Tá doiciméid taistil do leanaí d’aois 5-17 mbliana bailí ar feadh a mhéid agus 10 mbliana

source: A travel document for a child aged under 5 is valid for up to 5 years
ga: Tá doiciméid taistil do leanbh faoi 5 bliana d’aois bailí ar feadh a mhéid agus 5 bliana

source: If you have do not have refugee status or subsidiary protection but have been granted permission to remain in Ireland, you should apply for a passport to the embassy of your country
ga: Mura bhfuil stádas dídeanaithe nó fochosanta agat ach gur bronnadh cead fanachta in Éirinn ort, ba chóir duit iarratas ar phas a dhéanamh chuig ambasáid do thíre

source: In some exceptional cases people who have been granted permission to remain and who do not have a passport, may be issued with an alternative travel document by the Minister for Justice and Equality
ga: I gcásanna eisceachtúla áirithe a bhaineann le daoine ar ceadaíodh dóibh fanacht agus nach bhfuil pas acu, d’fhéadfadh an tAire Dlí agus Cirt agus Comhionannais doiciméad taistil malartach a eisiúint

source: If you are issued with an alternative travel document, it will be valid until the expiry date of your Certificate of Registration (GNIB card)
ga: Má eisítear doiciméad taistil malartach duit, beidh sé bailí suas go dtí dáta éaga do Theastas Inimirce de Chlárú (cárta BNGSI)

source: You must obtain a re-entry visa before you leave the State otherwise you may have difficulties re-entering
ga: Caithfidh tú víosa athiontrála a fháil sula bhfágann tú an Stát nó b’fhéidir go mbeidh deacrachtaí agat agus tú ag iarraidh ath-iontráil

source: You also need a visa to enter other EU countries
ga: Teastaíonn víosa uait chomh maith chun dul isteach i dtíortha eile an AE

source: The application fee for a travel document is €80
ga: Is €80 táille iarrataís ar cháipéis taistil

source: A single entry visa costs €60 and a multiple entry visa costs €100
ga: Cosnaíonn víosa aon-iontrála €60 agus tá €100 ar víosa il-iontrála

source: You apply to the Travel Document Unit of INIS using the travel document application form (pdf) - see 'Where to apply' below
ga: Ba chóir duit iarratas a dhéanamh ar an tAonad Seirbhísí Dhoiciméid Taistil don Seirbhís Eadóirseach (SEIÉ) ag baint úsáide duit as an leagan den iarrtais ar cháipéis tastil (pdf) - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: You should include the following with your completed application:
ga: Ba chóir duit na nithe a leanas a chur san áireamh leis an iarratas comhlánaithe:

source: • Four passport-sized photographs - check the photographic requirements for a travel document (pdf)
ga: • Ceithre ghrianghraf pas - ba cheart duit na riachtanais maidir le grianghraif le haghaidh cáipéis taistil a sheiceáil (pdf)

source: • Fee of €80 - you should pay by bank draft or postal order, made payable to the Department of Justice and Equality
ga: • Táille €80 - ba chóir duit íocaíocht a dhéanamh trí dhréacht bainc nó ordú poist, iníoctha leis an Roinn Dlí agus Cirt agus Comhionannais

source: • A copy of your Certificate of Registration, also known as your GNIB card
ga: • Cóip de Deimhniú Clárúcháin, nó Cárta BNGSI mar a thugtar air freisin

source: A member of the Garda Síochána must sign and stamp 2 of the photographs when witnessing your form
ga: Ní mór do bhall den Gharda Síochána dhá cheann de na grianghraif a shíniú agus a stampáil agus an ball sin ina f(h)inné ort agus an fhoirm á comhlíonadh agat

source: It will take 4-6 weeks to process your application and your travel document will be sent to you by registered post
ga: Glacfaidh sé idir 4 agus 6 seachtaine le d’iarratas a phróiseáil agus seolfar do dhoiciméid taistil chugat tríd an bpost cláraithe

source: If your application is refused you will be informed in writing
ga: Má dhiúltaítear do d’iarratas, cuirfear ar an eolas thú i scríbhinn

source: You are advised not to make any travel arrangements until you receive your travel document
ga: Ní mholtar duit aon socruithe taistil a dhéanamh go dtí go bhfaigheann tú do dhoiciméid taistil

source: Re-entry visas: Before making any travel arrangements you must apply for a re-entry visa using the re-entry visa application form
ga: Víosaí athiontrála: Sula ndéanfaidh tú socrú taistil ar bith, ní mór duit iarratas a dhéanamh le hOifig Víosaí SEIÉ ag baint úsáide duit as an bhfoirm iarratais ar víosa athiontrála

source: You should check the INIS website for information on how to apply and current processing times
ga: Tá faisnéis ar an suíomh SEIÉ maidir le conas iarratas a dhéanamh agus na tréimhsí phróiseála reatha
